IDENTIFICATION DIVISION.
PROGRAM-ID. TEST-INQUIRY.

DATA DIVISION.
WORKING-STORAGE SECTION.

01 WS-FAILURES         PIC 9 VALUE 0.

01 WS-TEST-ACCOUNT-ID  PIC 9(10).
01 WS-TEST-BALANCE     PIC S9(9)V99.
01 WS-TEST-CODE        PIC 9.

PROCEDURE DIVISION.

MAIN-PROCESS.


DISPLAY "================================="
DISPLAY "      TEST INQUIRY"
DISPLAY "================================="
DISPLAY " "

PERFORM TEST-VALID-ACCOUNT
PERFORM TEST-INVALID-ACCOUNT
PERFORM TEST-ACCOUNT-ZERO

DISPLAY " "
DISPLAY "---------------------------------"
DISPLAY "Tests executados: 3"
DISPLAY "Falhas: " WS-FAILURES
DISPLAY "---------------------------------"

IF WS-FAILURES = 0
    DISPLAY "ALL TESTS PASSED"
    MOVE 0 TO RETURN-CODE
ELSE
    DISPLAY "TESTS FAILED"
    MOVE 1 TO RETURN-CODE
END-IF

GOBACK.


TEST-VALID-ACCOUNT.


MOVE 1000000001 TO WS-TEST-ACCOUNT-ID
MOVE 1500.00 TO WS-TEST-BALANCE
MOVE 9 TO WS-TEST-CODE

CALL "INQUIRY"
    USING WS-TEST-ACCOUNT-ID
          WS-TEST-BALANCE
          WS-TEST-CODE

IF WS-TEST-BALANCE = 1500.00
   AND WS-TEST-CODE = 0
    DISPLAY "[PASS] Inquiry valid account"
ELSE
    DISPLAY "[FAIL] Inquiry valid account"
    ADD 1 TO WS-FAILURES
END-IF.


TEST-INVALID-ACCOUNT.


MOVE 9999999999 TO WS-TEST-ACCOUNT-ID
MOVE 1500.00 TO WS-TEST-BALANCE
MOVE 9 TO WS-TEST-CODE

CALL "INQUIRY"
    USING WS-TEST-ACCOUNT-ID
          WS-TEST-BALANCE
          WS-TEST-CODE

IF WS-TEST-BALANCE = 1500.00
   AND WS-TEST-CODE = 0
    DISPLAY "[PASS] Inquiry unknown account"
ELSE
    DISPLAY "[FAIL] Inquiry unknown account"
    ADD 1 TO WS-FAILURES
END-IF.


TEST-ACCOUNT-ZERO.


MOVE 0 TO WS-TEST-ACCOUNT-ID
MOVE 1500.00 TO WS-TEST-BALANCE
MOVE 9 TO WS-TEST-CODE

CALL "INQUIRY"
    USING WS-TEST-ACCOUNT-ID
          WS-TEST-BALANCE
          WS-TEST-CODE

IF WS-TEST-BALANCE = 1500.00
   AND WS-TEST-CODE = 3
    DISPLAY "[PASS] Inquiry zero account"
ELSE
    DISPLAY "[FAIL] Inquiry zero account"
    ADD 1 TO WS-FAILURES
END-IF.

