IDENTIFICATION DIVISION.
PROGRAM-ID. INQUIRY.

DATA DIVISION.
LINKAGE SECTION.

01 LK-ACCOUNT-ID       PIC 9(10).
01 LK-BALANCE          PIC S9(9)V99.
01 LK-RETURN-CODE      PIC 9.

PROCEDURE DIVISION USING LK-ACCOUNT-ID
LK-BALANCE
LK-RETURN-CODE.


MOVE 9 TO LK-RETURN-CODE

IF LK-ACCOUNT-ID = 0
    MOVE 3 TO LK-RETURN-CODE
    GOBACK
END-IF

MOVE 0 TO LK-RETURN-CODE

GOBACK.

