IDENTIFICATION DIVISION.
PROGRAM-ID. VALIDATE_ACCOUNT.

DATA DIVISION.
LINKAGE SECTION.

01 LK-ACCOUNT-ID       PIC 9(10).
01 LK-RETURN-CODE      PIC 9.

PROCEDURE DIVISION USING LK-ACCOUNT-ID
LK-RETURN-CODE.


MOVE 9 TO LK-RETURN-CODE

IF LK-ACCOUNT-ID = 0
    MOVE 3 TO LK-RETURN-CODE
    GOBACK
END-IF

IF LK-ACCOUNT-ID = 1000000001
    MOVE 0 TO LK-RETURN-CODE
ELSE
    MOVE 3 TO LK-RETURN-CODE
END-IF

GOBACK.

