IDENTIFICATION DIVISION.
PROGRAM-ID. WITHDRAW.

DATA DIVISION.
LINKAGE SECTION.

01 LK-BALANCE          PIC S9(9)V99.
01 LK-AMOUNT           PIC S9(9)V99.
01 LK-RETURN-CODE      PIC 9.

PROCEDURE DIVISION USING LK-BALANCE
LK-AMOUNT
LK-RETURN-CODE.


MOVE 9 TO LK-RETURN-CODE

IF LK-AMOUNT <= 0
    MOVE 1 TO LK-RETURN-CODE
    GOBACK
END-IF

IF LK-AMOUNT > LK-BALANCE
    MOVE 2 TO LK-RETURN-CODE
    GOBACK
END-IF

SUBTRACT LK-AMOUNT FROM LK-BALANCE

MOVE 0 TO LK-RETURN-CODE

GOBACK.

