       IDENTIFICATION DIVISION.
       PROGRAM-ID. HST1.

       DATA DIVISION.
       WORKING-STORAGE SECTION.
       EXEC SQL INCLUDE SQLCA END-EXEC.
       01 WS-ACCOUNT-ID PIC 9(10).
       01 WS-COUNT PIC 9(4).

       PROCEDURE DIVISION.
           EXEC CICS RECEIVE END-EXEC.

           EXEC SQL
               SELECT COUNT(*) INTO :WS-COUNT
                 FROM BANK_TRANSACTION
                WHERE ACCOUNT_ID = :WS-ACCOUNT-ID
           END-EXEC.

           EXEC CICS SEND TEXT END-EXEC.
           EXEC CICS RETURN END-EXEC.
